## Plan Result (Aks)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_extension.microsoft_flux_extension
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_flux_configuration.microsoft_flux_configuration
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_extension.microsoft_flux_extension
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_flux_configuration.microsoft_flux_configuration




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ba206872-8722-4375-bf4d-a28c39dff414"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_extension.microsoft_flux_extension will be created
  + resource "azurerm_kubernetes_cluster_extension" "microsoft_flux_extension" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-00-aks"
      + current_version       = (known after apply)
      + extension_type        = "microsoft.flux"
      + id                    = (known after apply)
      + name                  = "microsoft-flux-extension"
      + release_namespace     = (known after apply)
      + release_train         = (known after apply)
      + target_namespace      = (known after apply)
    }

  # module.kubernetes["00"].azurerm_kubernetes_flux_configuration.microsoft_flux_configuration will be created
  + resource "azurerm_kubernetes_flux_configuration" "microsoft_flux_configuration" {
      + cluster_id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-00-aks"
      + continuous_reconciliation_enabled = true
      + id                                = (known after apply)
      + name                              = "microsoft-flux-configuration"
      + namespace                         = "flux"
      + scope                             = "namespace"

      + git_repository {
          + reference_type           = "branch"
          + reference_value          = "master"
          + sync_interval_in_seconds = 600
          + timeout_in_seconds       = 600
          + url                      = "https://raw.githubusercontent.com/hmcts/ss-flux-config/master"
        }

      + kustomizations {
          + depends_on                 = []
          + garbage_collection_enabled = false
          + name                       = "flux-system"
          + path                       = ".apps/flux-system/base"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 600
          + sync_interval_in_seconds   = 600
          + timeout_in_seconds         = 600
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_extension.microsoft_flux_extension will be created
  + resource "azurerm_kubernetes_cluster_extension" "microsoft_flux_extension" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks"
      + current_version       = (known after apply)
      + extension_type        = "microsoft.flux"
      + id                    = (known after apply)
      + name                  = "microsoft-flux-extension"
      + release_namespace     = (known after apply)
      + release_train         = (known after apply)
      + target_namespace      = (known after apply)
    }

  # module.kubernetes["01"].azurerm_kubernetes_flux_configuration.microsoft_flux_configuration will be created
  + resource "azurerm_kubernetes_flux_configuration" "microsoft_flux_configuration" {
      + cluster_id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks"
      + continuous_reconciliation_enabled = true
      + id                                = (known after apply)
      + name                              = "microsoft-flux-configuration"
      + namespace                         = "flux"
      + scope                             = "namespace"

      + git_repository {
          + reference_type           = "branch"
          + reference_value          = "master"
          + sync_interval_in_seconds = 600
          + timeout_in_seconds       = 600
          + url                      = "https://raw.githubusercontent.com/hmcts/ss-flux-config/master"
        }

      + kustomizations {
          + depends_on                 = []
          + garbage_collection_enabled = false
          + name                       = "flux-system"
          + path                       = ".apps/flux-system/base"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 600
          + sync_interval_in_seconds   = 600
          + timeout_in_seconds         = 600
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/disks-sbox-rg" -> null
        name     = "disks-sbox-rg"
        tags     = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":530,"Program":"tfcmt","SHA1":"","Target":"Aks","Vars":{}} -->